package main

import "fmt"

func main() {
	a := 5
	changeVal(a)
	fmt.Println(a)
	changeValPointer(&a)
	fmt.Println(a)

	x := 50
	y := 5
	result1 := multiply1(x, y)
	result2 := multiply2(&x, &y)
	fmt.Println(result1)
	fmt.Println(result2)
	fmt.Println(x)
	fmt.Println(y)
}

func changeVal(a int) {
	a = 100
}

func changeValPointer(a *int) {
	*a = 100
}

func multiply1(a int, b int) int {
	return a * b
}

func multiply2(a, b *int) int {
	*a = *a * 5
	return *a * *b
}

/*

| ارسال مقدار معمولی (by value)                                     | ارسال آدرس (by pointer)                                                  |
| ----------------------------------------------------------------- | ------------------------------------------------------------------------ |
| **کپی مقدار متغیر به پارامتر تابع**                               | **آدرس حافظه متغیر به پارامتر تابع ارسال می‌شود**                        |
| تغییرات داخل تابع روی پارامتر اثر دارد اما روی متغیر اصلی نه      | تغییرات داخل تابع مستقیماً روی مقدار متغیر اصلی اعمال می‌شود             |
| مصرف حافظه بیشتر (چون مقدار کپی می‌شود)                           | مصرف حافظه کمتر (فقط آدرس ارسال می‌شود)                                  |
| برای انواع داده کوچک (مثلاً int، float) معمول است                 | برای داده‌های بزرگ یا وقتی می‌خواهیم مقدار اصلی تغییر کند استفاده می‌شود |
| تغییر در مقدار تابع فقط محلی است و پس از برگشت تابع از بین می‌رود | تغییر در مقدار تابع، تغییر اصلی متغیر است                                |

*/
