package main

import "fmt"

// وقتی که فرستنده دیگه هیچ داده‌ای قرار نیست بفرسته، باید کانال رو ببنده (close).
// این‌جوری گیرنده‌ها متوجه میشن که کانال دیگه داده‌ای نداره
func main() {
	x := make(chan int)
	go func() {
		for i := 0; i <= 5; i++ {
			x <- i
		}
		close(x)
	}()
	for num := range x {
		fmt.Println(num)
	}
}

/*
فقط فرستنده (sender) باید کانال رو ببنده.
(گیرنده حق بستن نداره مگر اون هم سازنده باشه)
وقتی کانال بسته شد: دیگه نمی‌شه چیزی توش فرستاد → اگه امتحان کنی panic میده.
ولی همچنان می‌شه ازش خوند.
وقتی از یه کانال بسته بخونی:
اگه هنوز بافر خالی نشده، مقدارهای باقی‌مونده رو می‌گیری.
اگه کامل خالی شده → مقدار صفر تایپ (zero value) برمی‌گرده.
مثلا int → 0, string → "", bool → false.

تشخیص بسته بودن کانال
v, ok := <-ch
if !ok {
    fmt.Println("کانال بسته شده")
}

*/
